*>---------------
*> system-ws.cpy
*>---------------
01  ws-sys-record.
  05  ws-sys-record-ver-major pic 9(02).
	05  ws-sys-record-ver-minor pic 9(02).

