*>---------------
*> version-ws.cpy
*>---------------
01  ws-system-record-version.
  05  ws-system-record-version-major pic 9(02).
	05  ws-system-record-version-minor pic 9(02).

